Tekla Open API Reference for Tekla Structures 2025
LineTypes.SlashDash Field
 The slash dash line (-- - -- -).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static readonly LineTypes SlashDash
Public Shared ReadOnly SlashDash As LineTypes
Field Value
Type: LineTypes
See Also
Reference
LineTypes Class
Tekla.Structures.Drawing Namespace